<?php

$LETTERS="/^[a-zA-ZÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõöøùúûüýþÿĀāĂăĄąĆćĈĉĊċČčĎďĐđĒēĔĕĖėĘęĚěĜĝĞğĠġĢģĤĥĦħĨĩĪīĬĭĮįİıĲĳĴĵĶķĸĹĺĻļĽľĿŀŁłŃńŅņŇňŉŊŋŌōŎŏŐőŒœŔŕŖŗŘřŚśŜŝŞşŠšŢţŤťŦŧŨũŪūŬŭŮůŰűŲųŴŵŶŷŸŹźŻżŽžαAβBγΓδΔϵEζZηHθΘιIκKλΛμMνNξΞοOπΠρPσΣτTυΥφΦχXψΨωΩ]+$/";
$NUMBERS="/^[0-9]+$/";
$DECIMALS="/^[0-9]+(\.[0-9]{1,3})?$/";
$ALPHANUMERIC="/^[a-zA-Z0-9]+$/";
$SYMBOLS="";
$TELEFONIC="/^\+?\d+$/";
$DATE="/^[0-9]{4}-(0[1-9]|1[0-2])-(0[1-9]|[1-2][0-9]|3[0-1])$/";
$TIME="/^(([0-1][0-9]|2[0-3]):[0-5][0-9]?)$/";

?>